<?php include ("{$_SERVER['DOCUMENT_ROOT']}/template/inc/header.php"); ?>

<h1>Ну что ж, начнем?</h1>
<p>В каком-то далеком году, то ли 2016, то ли 2017, создал для себя небольшую песочницу, дабы понакидывать простинького HTML-кода, который время от времени использовал для работы с сайтами в одной web-студии. Шли "года" и тестовый сайтик пылился в индексе Гугла на задворках одного бесплатного хостинга, пока шара не была окончена и хостер не прикрыл лавочку в 2018г. "Мы" перебрались на локальный сервак моего ПК до лучших времен.</p>
<p>Спустя время этот, с позволения сказать, проект вернулся из небытия после моего "знакомства" с PHP-курсами в одной славной компании SkillUp. И теперь бум на этом "проекте" тестировать всяко-разно из того, что будет на курсах: тут тебе и ГитХаб, и что-то поверстке, прочие мелочи, ну а самое главное, думаю, тут мы будем тестировать/пробовать PHP в деле.</p>
<p>Ну а дальше время покажет</p>

<p>Разбираем PHP, JS, sql и другие сопутсвующие технологии</p>

<ul>
<li><a href="/study_theory/">Теория</a></li>
<li><a href="/study_working/">Практика</a></li>
</ul>

<!--<p>Тут у нас:</p>
<ul>
	<li><a href="/img0">Картинки</a> и то, что с ними модно творить</li>
	<li>и <a href="/links/">несколько ссылок</a></li>
	<li><a href="/github/">github</a></li>
	<li><a href="/practice/4js/">Ломаем JS</a></li>
	<li><a href="/practice/4php/">Ломаем PHP</a>
		<ul><li><a href="/practice/forms/">Разбираем формы</a></li></ul>
	</li>
	<li><a href="/practice/db/">БД и SQL запросы</a>
		<ul>
			<li><a href="/practice/db/homework.php">Практика и ДЗ</a></li>
		</ul>
	</li>
	<li>и пр.</li>
</ul>
-->
<?php include ("{$_SERVER['DOCUMENT_ROOT']}/template/inc/footer.php"); ?>
<?php // https://prnt.sc/nfulsz
//include '../template/inc/footer.php'; ?>