<?php include "template/inc/header.php"; ?>

<h1>Ну что ж, начнем?</h1>
<p>В каком-то далеком году, то ли 2016, то ли 2017, создал для себя небольшую песочницу, дабы понакидывать простинького HTML-кода, который время от времени использовал для работы с сайтами в одной web-студии. Шли "года" и тестовый сайтик пылился в индексе Гугла на задворках одного бесплатного хостинга, пока шара не была окончена и хостер не прикрыл лавочку в 2018г. "Мы" перебрались на локальный сервак моего ПК до лучших времен.</p>
<p>Спустя время этот, с позволения сказать, проект вернулся из небытия после моего "знакомства" с PHP-курсами в одной славной компании SkillUp. И теперь бум на этом "проекте" тестировать всяко-разно из того, что будет на курсах: тут тебе и ГитХаб, и что-то поверстке, прочие мелочи, ну а самое главное, думаю, тут мы будем тестировать/пробовать PHP в деле.</p>
<p>Ну а дальше время покажет</p>

<p>Разбираем PHP, JS, sql и другие сопутсвующие технологии</p>

<ul>
<li><a href="/study_theory/">Теория</a></li>
<li><a href="/study_working/">Практика</a></li>
</ul>

<?php include "template/inc/footer.php"; ?>